-- online_category
INSERT INTO `shop`.`online_category`
(`CTGR_ID`, `NAME`, `LAST_UPD_DATE`)
VALUES
(1, '家具', now()), (2, '家電', now()), (3, '食品', now()), (4, '雑貨', now()), (5, 'ペット', now());

-- online_product
INSERT INTO `shop`.`online_product`
(`PRODUCT_CODE`, `CATEGORY_ID`, `PRODUCT_NAME`, `MAKER`, `STOCK_COUNT`, `REGISTER_DATE`, `UNIT_PRICE`, `PICTURE_NAME`, `MEMO`, `DELETE_FLG`, `LAST_UPD_DATE`)
VALUES
('001-191201-001', 1, '勉強机', '×〇家具', 50, curdate(), 10000, 'benkyotukue.jpg', '勉強に最適な机です', 0, now()),
('001-191201-002', 1, '間違っちゃった勉強机', '×〇家具', 50, curdate(), 10000, 'benkyotukue.jpg', '無効化された机', 1, now()),
('001-191202-001', 1, '本棚', '△△家具', 100, curdate(), 2000, 'bookshelf.jpg', '大容量入ります', 0, now()),
('002-191203-001', 2, '電子レンジ', '山口電機', 1000, curdate(), 20000, 'denshirenzi.jpg', '玉子をそのまま入れると爆発します', 0, now()),
('003-191204-001', 3, 'やみつきドックフード', 'ワンワンフーズ', 1000, curdate(), 100, 'dogfood.jpg', 'イヌまっしぐら', 0, now()),
('002-191204-001', 2, '業務用冷蔵庫', '山口電機', 100, curdate(), 210000, 'gyomuyoreizoko.jpg', '子供は入れないでください', 0, now()),
('001-191205-001', 1, '二人掛け座椅子', 'ナトリ', 200, curdate(), 10000, 'hutarigakezaisu.jpg', '二人乗っても大丈夫', 0, now()),
('005-191205-001', 5, '犬一号', 'スーパーペットショップ', 10, curdate(), 1000000, 'inuitigo.jpg', 'どんな強盗も追い払える強いワンワン', 0, now()),
('005-191205-002', 5, '犬二号', 'スーパーペットショップ', 20, curdate(), 500000, 'inunigo.jpg', 'つぶらな瞳', 0, now()),
('003-191206-001', 3, '茎わかめ', 'マロハ', 20000, curdate(), 50, 'kukiwakamesio.jpg', 'おやつにどうぞ', 0, now()),
('003-191206-002', 3, '茎わかめ梅しそ味', 'マロハ', 20000, curdate(), 50, 'kukiwakameume.jpg', '梅しそ味　おやつにどうぞ', 0, now()),
('002-191206-001', 2, 'フローリングライト', 'コドバシ電気', 20, curdate(), 5000, 'ledlight.jpg', 'へぁぁぁぁぁ目がぁ！目がぁ！', 0, now()),
('005-191207-001', 5, '猫一号', 'スーパーペットショップ', 20, curdate(), 500000, 'nekoichigo.jpg', '戦闘力53万', 0, now()),
('005-191207-002', 5, '猫二号', 'スーパーペットショップ', 20, curdate(), 300000, 'nekonigo.jpg', 'やる気はどこかに置いてきた', 0, now()),
('005-191207-003', 5, '猫三号', 'スーパーペットショップ', 10, curdate(), 400000, 'nekosango.jpg', '箱入り子猫', 0, now()),
('001-191207-001', 1, '大きなソファ', '△△家具', 10, curdate(), 2000, 'okinasofa.jpg', '寝落ち注意', 0, now()),
('004-191207-001', 4, 'ペンケース', '四菱', 1000, curdate(), 1000, 'pencase.jpg', '素朴なペンケース', 0, now()),
('004-191207-002', 4, 'ピー子', 'バラエティショップ', 1000000, curdate(), 10, 'piko.jpg', '鳴き声がとってもうるさい', 0, now()),
('004-191207-003', 4, 'ランドセル', 'ナトリ', 10000, curdate(), 105, 'randoseru.jpg', 'おしゃれなお子様に大人気のランドセル', 0, now()),
('004-191207-004', 4, 'リコーダー', 'ナトリ', 10000, curdate(), 120, 'rikoda.jpg', '小学生の必需品', 0, now()),
('001-191208-004', 1, 'ロッキングチェア', 'ナトリ', 1000, curdate(), 3000, 'rockingchair.jpg', 'ヴェルタースオリジナルを渡してきそうなおじいさんが好きな椅子', 0, now()),
('002-191208-001', 2, 'パワフル洗濯機', '山口電機', 10, curdate(), 3000000, 'sentakuki.jpg', 'あらゆる汚れを落とします', 0, now()),
('003-191208-001', 3, 'お徳用そうめん', '美味食品', 10000, curdate(), 30, 'somen.jpg', '流しそうめんにもつかえます', 0, now()),
('002-191208-002', 2, '掃除機', 'ダイソソ', 10000, curdate(), 20000, 'soziki.jpg', '吸引力の変わらないただ一つの掃除機', 0, now()),
('003-191208-002', 3, '空気', '地球', 10000, curdate(), 10, '', '吸えます', 0, now()),
('003-191208-003', 3, 'おいしい水', '地球', 10000, curdate(), 10, '', '飲めます', 0, now());

